class Paymentse {
  String name;

  String lebbel;

  Paymentse({
    required this.name,
    required this.lebbel,
  });
}

List<Paymentse> paymentse = [
  Paymentse(
    name: "ค่าบริการทันตกรรม",
    lebbel:
        "ในการจัดทำอัตราค่าบริการสาธารณสุขเพื่อใช้สำหรับการเบิกจ่ายค่ารักษาพยาบาลในสถานพยาบาลของทางราชการ กระทรวงการคลังโดยกรมบัญชีกลางได้จัดทำโดยอาศัยข้อมูลที่กระทรวงสาธารณสุข "
        "ใช้ในการกำหนดอัตราค่าบริการ ของสถานบริการสาธารณสุขในสังกัดกระทรวงสาธารณสุข พ.ศ. 2547 เป็นฐานในการคำนวณเนื่องจากมีความครอบคลุม และได้เชิญผู้แทนจากสถานพยาบาลในสังกัดต่างๆ ซึ่งได้แก่ สถานพยาบาลในสังกัดโรงเรียนแพทย์ กระทรวงกลาโหม กระทรวงสาธารณสุข\n"
        "ค่าบริการทางทันตกรรม หมายถึง ค่าบริการในการรักษาทางทันตกรรมตามรายหัตถการหรือรายโรค โดยการคิดค่าบริการให้คิดครอบคลุม ค่าเครื่องมือ ค่ายาพื้นฐานที่ใช้ และวัสดุสิ้นเปลืองด้วย"
        "ทั้งนี้ ค่าบริการทางทันตกรรมที่เบิกได้ต้องเป็นไปเพื่อการรักษาพยาบาลการเจ็บป่วยหรืออุบัติเหตุ เช่น การถอนฟัน อุดฟัน ขูดหินปูน การจัดฟันเฉพาะกรณีประสบอุบัติเหตุ (โดยให้มีหนังสือรับรองแสดงเป็นหลักฐานประกอบการเบิกจ่าย) การพิมพ์ปาก เพื่อการรักษา"
        "สำหรับค่าจัดฟัน ค่าใส่เดือย ค่าฟันเทียม ค่าครอบฟัน และการทำหัตถการเพื่อเป็นการป้องกัน (เช่นการเคลือบหลุมร่องฟัน เคลือบฟลูออไรด์) เบิกไม่ได้\n",
  ),
  Paymentse(
    name: "หมายเหตุ",
    lebbel: "1. ให้คณะกรรมการบริหารโรงพยาบาลกำหนด และประกาศอัตราค่า\n"
        "- LAB ตามรายการ เป็นประจำทุกปีโดยสามารถคิดเพิ่มจากต้นทุนค่า\n"
        "- LAB ได้ไม่เกินร้อยละ 10 (ในผู้ป่วยอุบัติเหตุที่ใช้บริการทันตกรรมประดิษฐ์\n"
        "2. ค่าบริการทันตกรรมใดที่ไม่ได้กำหนดไว้ในอัตราค่าบริการนี้ ไม่สามารถเบิกจ่ายได้\n",
  ),
  Paymentse(
    name: "หลักการและแนวคิด",
    lebbel:
        "ในการจัดทำอัตราค่าบริการสาธารณสุขเพื่อใช้สำหรับการเบิกจ่ายค่ารักษาพยาบาลในสถานพยาบาลของทางราชการกระทรวงการคลังโดยกรมบัญชีกลาง"
        "ได้จัดทำโดยอาศัยข้อมูลที่กระทรวงสาธารณสุขใช้ในการกำหนดอัตราค่าบริการของสถานบริการสาธารณสุข"
        "ในสังกัดกระทรวงสาธารณสุข พ.ศ. 2547 เป็นฐานในการคำนวณ เนื่องจากมีความครอบคลุม และได้เชิญผู้แทนจากสถานพยาบาลในสังกัดต่างๆ ซึ่งได้แก่ "
        "สถานพยาบาลในสังกัดโรงเรียนแพทย์ กระทรวงกลาโหม กระทรวงสาธารณสุข เข้าร่วมพิจารณาด้วย โดยอัตราค่าบริการดังกล่าว ประกอบด้วย\n\n"
        "1.  ต้นทุนแรงงาน (Labor Cost: LC) คิดเฉพาะค่าตอบแทนที่เป็นเงินนอกงบประมาณ โดยคิดในอัตราร้อยละ 50 จากต้นทุนแรงงานของกระทรวงสาธารณสุข\n"
        "2.  ต้นทุนวัสดุ (Material Cost: MC) คิดจากวัสดุที่สถานพยาบาลต้องใช้ในการให้บริการในกิจกรรมนั้นๆ\n"
        "3.  ต้นทุนครุภัณฑ์ สิ่งก่อสร้าง (Capital Cost: CC) คิดจากค่าเสื่อมราคาของเครื่องมือแพทย์และอาคารที่ใช้ในการให้บริการในกิจกรรมนั้นๆ"
        "โดยเครื่องมือแพทย์คิดค่าเสื่อมราคาตามอายุการใช้งานของเครื่องมือแต่ละประเภท ส่วนอาคารสิ่งก่อสร้างคิดค่าเสื่อมราคาจากอายุการใช้งาน 25 ปี\n"
        "4.  ต้นทุนค่าบริหารจัดการ (Overhead Cost) คิดจากร้อยละ 20 ของต้นทุนรวม LC, MC และ CC "
        "ซึ่งเป็นต้นทุนทางตรง ค่าบริหารจัดการเป็นต้นทุนทางอ้อมที่เกิดจากการใช้ทรัพยากรร่วมกันของทุกแผนกในโรงพยาบาล "
        "เช่น ค่าสาธารณูปโภคซึ่งปกติในการคำนวณจะต้องมีการกระจายต้นทุน (ปันส่วน) "
        "จากหน่วยสนับสนุนทุกหน่วยเข้าสู่หน่วยผลิตแต่ละหน่วยเป็นสัดส่วนตามชั่วโมงการทำงาน กิจกรรม "
        "และในกรณีที่ไม่สามารถกระจายต้นทุนได้ตามที่ใช้จริง สามารถคิดจากต้นทุนทางตรงได้\n"
        "5.  ต้นทุนการพัฒนา (Future Development Cost) เป็นกำไรเพื่อใช้ในการพัฒนา"
        "ขณะนี้คิดในอัตราร้อยละ 20-25 ของต้นทุนรวม LC, MC, CC และ Overhead Cost "
        "(ขึ้นกับนโยบายซึ่งอาจมีการเปลี่ยนแปลงได้) สำหรับค่ายาให้เบิกจ่ายโดยบวกเพิ่ม (Mark up) "
        "เป็นขั้น (Step) เพื่อความเหมาะสมจากราคาต้นทุนต่อหน่วย เนื่องจากในการคิดอัตราค่าบริการได้รวมต้นทุนและกำไรไว้แล้ว"
        "จึงไม่จำเป็นต้องนำกำไรจากค่ายาไปอุดหนุนค่าบริการรายการอื่น\n\n",
  ),
  Paymentse(
    name:
        "การเบิกค่าใช้จ่ายตามอัตราค่าบริการสาธารณ\nสุขเพื่อใช้สำหรับการเบิกจ่ายค่ารักษาพยาบาล\nในสถานพยาบาลของทางราชการ",
    lebbel:
        "อัตราค่าบริการสาธารณสุขเพื่อใช้สำหรับการเบิกจ่ายค่ารักษาพยาบาลในสถานพยาบาลของทางราชการ แบ่งออกเป็น 16 หมวด ตามการจำแนกหมวดรายจ่ายประเภทผู้ป่วยใน ซึ่งได้แก่\n\n"
        "หมวดที่ 1 ค่าห้องและค่าอาหาร\n"
        "หมวดที่ 2 ค่าอวัยวะเทียมและอุปกรณ์ในการบำบัดรักษาโรค\n"
        "หมวดที่ 3 ค่ายาและสารอาหารทางเส้นเลือด\n"
        "หมวดที่ 4 ค่ายากลับบ้าน\n"
        "หมวดที่ 5 ค่าเวชภัณฑ์ที่มิใช่ยา\n"
        "หมวดที่ 6 ค่าบริการโลหิตและส่วนประกอบของโลหิต\n"
        "หมวดที่ 7 ค่าตรวจวินิจฉัยทางเทคนิคการแพทย์และพยาธิวิทยา\n"
        "หมวดที่ 8 ค่าตรวจวินิจฉัยและรักษาทางรังสีวิทยา\n"
        "หมวดที่ 9 ค่าตรวจวินิจฉัยโดยวิธีพิเศษอื่นๆ\n"
        "หมวดที่ 10 ค่าอุปกรณ์ของใช้และเครื่องมือทางการแพทย์\n"
        "หมวดที่ 11 ค่าทำหัตถการและวิสัญญี\n"
        "หมวดที่ 12 ค่าบริการทางการพยาบาล\n"
        "หมวดที่ 13 ค่าบริการทางทันตกรรม\n"
        "หมวดที่ 15 ค่าบริการทางกายภาพบำบัดและทางเวชกรรมฟื้นฟู\n"
        "หมวดที่ 16 ค่าบริการฝังเข็มและค่าบริการการให้การบำบัดของผู้ประกอบโรคศิลปะอื่น\n"
        "หมวดที่ 17 ค่าบริการอื่นๆ ที่ไม่เกี่ยวกับการรักษาพยาบาลโดยตรง\n",
  ),
];

class Receipte {
  String name;

  String lebbel;

  Receipte({
    required this.name,
    required this.lebbel,
  });
}

List<Receipte> receipte = [
  Receipte(
    name: "สิทธิผู้ป่วยทางทันตกรรม",
    lebbel: ""
        "ข้อบังคับทันตแพทยสภาว่าด้วยจรรยาบรรณว่าด้วยวิชาชีพทันตกรรมว่าด้วยสิทธิของผู้ป่วย พ.ศ.2541"
        "โดยที่คำประกาศสิทธิของผู้ป่วยที่สภาวิชาชีพทางการแพทย์และกระทรวงสาธารณสุข ร่วมกันประกาศรับรองสิทธิของผู้ป่วย ตั้งแต่วันที่ 16 เมษายน 2541 เพื่อเป็นการรับรองสิทธิของผู้ป่วยต่อการรับบริการทางการแพทย์ แต่มิได้มีสภาพบังคับเป็นกฎหมายอย่างชัดเจน ทันตแพทยสภาเป็นองค์กรวิชาชีพทางการแพทย์ที่ร่วมรับรอง คำประกาศสิทธิผู้ป่วยดังกล่าว ดังนั้นเพื่อให้ผู้ประกอบวิชาชีพ ทันตกรรมตระหนักและปฏิบัติตามสิทธิของผู้ป่วยอย่างแท้จริง จึงสมควรให้คำประกาศสิทธิของผู้ป่วยมีผลทางกฎหมาย อันจะเป็นการคุ้มครองผู้รับบริการทางด้านทันตกรรม\n\n"
        "อาศัยอำนาจตามความในมาตรา 8 (4) มาตรา 9 (7) มาตรา 23 (4) (ฏ) (ฌ) โดยความเห็นชอบของสภานายกพิเศษตามมาตรา 27 แห่งพระราชบัญญัติวิชาชีพทันตกรรม พ.ศ.2537 และมติที่ประชุมคณะกรรมการทันตแพทยสภาในการประชุม ครั้งที่ /2550 เมื่อวันที่ พ.ศ.2550 จึงออกข้อบังคับทันตแพทยสภาว่าด้วยจรรยาบรรณแห่งวิชาชีพทันตกรรมว่าด้วยสิทธิของผู้ป่วย พ.ศ. ....ดังนี้\n\n"
        "1.  ให้ถือว่าข้อกำหนดในข้อบังคับนี้ เป็นจรรยาบรรณแห่งวิชาชีพทันตกรรมตามความหมายในข้อบังคับทันตแพทยสภาว่าด้วยจรรยาบรรณแห่งวิชาชีพทันตกรรม ผู้ป่วย หมายถึงผู้รับบริการทางวิชาชีพทันตกรรม\n"
        "2.  ให้ยกเลิกข้อความในข้อ 15 ของข้อบังคับทันตแพทยสภาว่าด้วยจรรยาบรรณแห่งวิชาชีพทันตกรรม พ.ศ.2538\n"
        "3.  ผู้ประกอบวิชาชีพทันตกรรมต้องยอมรับว่าผู้ป่วยทุกคนมีสิทธิ์พื้นฐานที่จะได้รับบริการด้านสุขภาพ ตามที่บัญญัติไว้ในรัฐธรรมนูญ\n"
        "4.  ผู้ประกอบวิชาชีพทันตกรรมต้องแจ้งข้อมูลอย่างเพียงพอและเข้าใจชัดเจนเพื่อให้ผู้ป่วยสามารถเลือกตัดสินใจในการยินยอมหรือไม่ยินยอมให้ผู้ประกอบวิชาชีพทันตกรรมปฏิบัติต่อตน เว้นแต่เป็นการช่วยเหลือเร่งด่วนหรือจำเป็น\n"
        "5.  ผู้ประกอบวิชาชีพทันตกรรมต้องให้ความช่วยเหลือผู้ป่วยที่อยู่ในภาวะอันตราย เสี่ยงต่อชีวิตอย่างรีบด่วน โดยทันทีตามความจำเป็นแก่กรณี โดยไม่คำนึงว่าผู้ป่วยจะร้องขอความช่วยเหลือหรือไม่\n"
        "6.  ผู้ประกอบวิชาชีพทันตกรรมต้องแจ้งชื่อ สกุล ประเภทของผู้ประกอบวิชาชีพทันตกรรมแก่ผู้ป่วย เมื่อได้รับการร้องขอ\n"
        "7.  ผู้ประกอบวิชาชีพทันตกรรมต้องยินดีและเปิดโอกาสให้ผู้ป่วยขอความเห็นจากผู้ประกอบวิชาชีพด้านทันตกรรมหรือด้านสุขภาพอื่น ที่มิได้เป็นผู้ให้บริการแก่ผู้ป่วยและให้ผู้ป่วยมีสิทธิขอเปลี่ยนผู้ให้บริการและสถานบริการได้\n"
        "8.  ผู้ประกอบวิชาชีพทันตกรรมต้องแจ้งข้อมูลอย่างครบถ้วน และอธิบายให้ผู้ป่วยเข้าใจเพื่อให้ผู้ป่วยตัดสินใจเข้าร่วมหรือถอนตัวจากการเป็นผู้ถูกทดลองในการทำวิจัยของผู้ประกอบวิชาชีพทันตกรรม\n"
        "9.  ผู้ประกอบวิชาชีพทันตกรมต้องเปิดโอกาสให้ผู้ป่วยได้รับทราบข้อมูลเกี่ยวกับการรักษาพยาบาลเฉพาะของตนที่ปรากฎในเวชระเบียนเมื่อผู้ป่วยร้องขอ ทั้งนี้ข้อมูลดังกล่าวต้องไม่เป็นการละเมิดสิทธิส่วนตัวของบุคคลอื่น\n"
        "10.  ผู้ประกอบวิชาชีพทันตกรรม ต้องให้สิทธิแก่บิดา มารดา หรือผู้แทนโดยชอบธรรมในการใช้สิทธิแทนผู้ป่วยที่เป็นเด็กอายุไม่เกินสิบแปดปีบริบูรณ์ ผู้บกพร่องทางกายหรือทางจิต ซึ่งไม่สามารถใช้สิทธิด้วยตนเอง ข้อบังคับนี้ให้ใช้บังคับตั้งแต่วันถัดจากวันประกาศในราชกิจจานุเบกษาเป็นต้นไป\n\n",
  ),
  Receipte(
    name: "สิทธิผู้ป่วย",
    lebbel:
        "“สิทธิ” คำๆนี้ ในช่วงเหตุการณ์ทางการเมืองบ้านเราที่ผ่านมา ค่อนข้างจะเป็นคำที่ยอดฮิตติดอันดับต้นๆเลยก็ว่าได้ ไม่ว่าจะเป็นกลุ่มของเสื้อเหลือง หรือเสื้อแดง ที่มักจะอ้างบ่อยๆว่า การชุมนุมของพวกเขาเหล่านั้นเป็นสิทธิตามรัฐธรรมนูญแห่งราชอาณาจักรไทย พ.ศ. 2550 มาตรา 63ที่ว่า บุคคลย่อมมีสิทธิในการชุมนุมโดยสงบปราศจากอาวุธ ซึ่งเป็นเรื่องของเสรีภาพในการชุมนุมที่รัฐให้การรับรอง แล้วถ้าเกี่ยวกับผู้ป่วยล่ะ ผู้ป่วยจะมีสิทธิอะไรได้บ้าง ? มีกฎหมายรับรองสิทธิไว้หรือไม่?\n\n"
        "สำหรับสิทธิของผู้ป่วยนั้น มีอยู่ 2 ส่วนด้วยกัน คือ สิทธิที่เกิดขึ้นโดยธรรมชาติในตัวเองเมื่ออยู่ในสถานภาพของผู้ป่วยเช่น สิทธิที่รับรู้ว่า ใครเป็นคนรักษา , จะทำการรักษาด้วยวิธีการอย่างไร ,ใช้อะไรบ้าง เป็นต้น ซึ่งสิทธิต่างนี้ จะเกิดขึ้นเองโดยที่ไม่จำเป็นต้องบัญญัติไว้ในกฎหมาย เป็นเรื่องที่สามารถสอบถามได้เสมอ\n\n"
        "ส่วนสิทธิอีกส่วนหนึ่งคือสิทธิที่เกิดขึ้นโดยบทบัญญัติของกฎหมาย โดยกำหนดขึ้นเพื่อให้การคุ้มครองผู้ป่วย เช่น รัฐธรรมนูญแห่งราชอาณาจักรไทย พ.ศ. 2550 มาตรา 51 บัญญัติไว้ว่า บุคคลย่อมมีสิทธิเสมอกันในการรับบริการทางสาธารณสุขที่เหมาะสมและได้มาตรฐาน และผู้ยากไร้มีสิทธิได้รับการรักษาพยาบาลจากสถานบริการสาธารณสุขของรัฐโดยไม่เสียค่าใช้จ่าย บุคคลย่อมมีสิทธิได้รับการบริการสาธารณสุขจากรัฐซึ่งต้องเป็นไปอย่างทั่วถึงและมีประสิทธิภาพ เป็นต้น ดังนั้น\n\n"
        "เพื่อให้ผู้ป่วยได้ทราบถึงสิทธิของตนเองไว้ว่าจะเป็นสิทธิตามธรรมชาติที่เกิดขึ้นหรือสิทธิที่กฎหมายได้บัญญัติรับรองไว้ และเพื่อให้ความสัมพันธ์ระหว่างผู้ป่วยกับผู้ประกอบวิชาชีพด้านสุขภาพ ตั้งอยู่บนพื้นฐานของความเข้าใจอันดีและเป็นที่ไว้วางใจซึ่งกันและกัน องค์กรวิชาชีพที่ให้บริการทางสาธารณสุข คือ แพทยสภา สภาการพยาบาล สภาเภสัชกรรม ทันตแพทยสภาและคณะกรรมการควบคุมการประกอบโรคศิลปะ ได้ตระหนักถึงความสำคัญของสิทธิผู้ป่วยดังกล่าว จึงได้รวบรวมและร่วมกันจัดทำเป็นคำประกาศสิทธิผู้ป่วย และกำหนดให้สถานพยาบาลทุกแห่งไม่ว่าจะเป็นของรัฐบาลหรือเอกชนติดคำประกาศดังกล่าวไว้ให้ประชาชนผู้เข้ามาใช้บริการได้ทราบถึงสิทธิของตนเอง ซึ่งคำประกาศสิทธิผู้ป่วยนั้น มีทั้งสิ้น 10 ข้อ บางคนเคยเห็นแต่ไม่เคยอ่าน บางคนก็อ่านแบบผ่านๆ ไม่ได้สนใจเท่าไหร่ จึงอยากจะขอให้ทุกท่านถ้าได้ไปใช้บริการสถานพยาบาลที่ใดก็ตาม หากมีเวลาก็ลองอ่านคำประกาศสิทธิผู้ป่วยอย่างละเอียดดู จะพบว่าเป็นสิทธิที่เราพึงมีพึงได้จริงๆ เพื่ออธิบายถึงสิทธิผู้ป่วยตามคำประกาศดังกล่าว จึงขอเสนอเป็นข้อๆดังนี้\n\n"
        "1.  เป็นสิทธิที่ทุกคนจะได้รับบริการด้านสุขภาพตามที่บัญญัติไว้ในรัฐธรรมนูญ ซึ่งปัจจุบันก็คือ รัฐธรรมนูญแห่งราชอาณาจักรไทย พ.ศ. 2550 มาตรา 51 บัญญัติให้ทุกคนย่อมมีสิทธิเสมอกันการรับบริการสาธารณสุขที่เหมาะสมและได้มาตรฐาน เป็นไปอย่างทั่วถึงและมีประสิทธิภาพ\n"
        "2.  สิทธิที่จะได้รับบริการโดยไม่มีการเลือกปฏิบัติเนื่องจากความแตกต่างด้านฐานะ เชื้อชาติ สัญชาติ ศาสนา สังคม ลัทธิการเมือง เพศ อายุ หมายความว่า ไม่ว่าจะเป็นใครก็ตาม จะชอบพรรคการเมืองใด, จะใส่เสื้อแดงหรือเสื้อเหลือง ,จะรวยหรือจน,จะเด็กหรือแก่ หล่อหรือไม่หล่อ หรือจะสวยหรือไม่สวยก็ตาม จะต้องได้รับบริการโดยเสมอภาคเท่าเทียมกัน ซึ่งในความเป็นจริงนั้นมักจะมีปัญหาในบางกรณีโดยเฉพาะในเรื่องของฐานะความรวยความจน ซึ่งมักจะมีเรื่องร้องเรียนกันบ่อยๆว่าคนจนมักจะได้รับบริการไม่เหมือนกับคนรวย\n"
        "3.  สิทธิที่จะได้รับทราบข้อมูลอย่างเพียงพอ เช่น ถ้าต้องการทราบว่าตนเองเป็นโรคอะไร ต้องรักษาด้วยวิธีไหน รักษาอย่างไรผลการรักษาจะเป็นเช่นไร มีโอกาสจะหายหรือไม่ ค่ารักษาเท่าไหร่ ก็มีสิทธิที่จะถามได้ หรือบางครั้งมีวิธีการรักษาหลายวิธีเราก็มีสิทธิที่จะเลือกวิธีใดวิธีหนึ่งได้ หรือตัดสินใจที่จะไม่ยอมให้รักษาก็ได้ เหตุที่ต้องถามเพราะบางครั้ง จำนวนผู้ป่วยมีมาก ใช้เวลาตรวจนาน ผู้ป่วยจึงมักไม่ค่อยได้รับการอธิบายโดยละเอียด หรือบางครั้งอธิบายไปแล้วผู้ป่วยไม่เข้าใจ หรือลืมไปแล้วว่าได้รับฟังมาอย่างไร ซึ่งมักจะมีปัญหาอยู่เสมอๆในเรื่องเหล่านี้\n"
        "4.  เมื่ออยู่ในภาวะเสี่ยงอันตรายถึงชีวิต ก็มีสิทธิที่จะได้รับการช่วยเหลือรีบด่วนโดยทันทีตามความจำเป็นแก่กรณีโดยไม่คำนึงว่าผู้ป่วยจะร้องขอหรือไม่ ซึ่งกรณีมักจะมีปัญหาและเป็นข่าวบ่อยๆที่เมื่อเกิดเหตุฉุกเฉินและไปถึงโรงพยาลบาลแล้ว หมอไม่ยอมรักษาเพราะต้องถามก่อนว่ามีเงินพอค่ารักษาหรือเปล่า ถ้าไม่พอก็จะส่งไปที่อื่นโดยไม่ได้ให้การรักษาเร่งด่วนตามแต่กรณีก่อน ซึ่งเหตุการณ์อย่างนี้ไม่สมควรจะเกิดขึ้นเลย\n"
        "5.  สิทธิที่จะทราบชื่อ สกุลของผู้ที่ให้บริการ เช่นเมื่อเข้าห้องตรวจผู้ป่วยสามารถถามชื่อหมอหรือพยาบาลที่จะทำการตรวจรักษาเราได้ ( แต่ส่วนใหญ่มักจะทราบอยู่แล้วเพราะมีชื่อหมอติดอยู่หน้าห้อง )\n"
        "6.  สิทธิที่จะขอความเห็นจากผู้ประกอบวิชาชีพด้านสุขภาพอื่นที่มิได้ให้บริการแก่ตนและมีสิทธิในการขอเปลี่ยนผู้ให้บริการและสถานบริการได้ เช่น เมื่อผู้ป่วยสงสัยในการตรวจ รักษา ก็มีสิทธิที่จะขอความเห็นจากหมออีกคนที่ไม่ได้เป็นผู้รักษาเราได้ หรือถ้ารักษากับหมอคนนี้แล้วไม่ถูกใจ หมอพูดไม่ดี ชอบดุหรือไม่ประทับใจ ก็ขอเปลี่ยนหมอได้ หรือถ้าไม่สะดวกที่จะมารักษาที่โรงพยาบาลนี้ก็สามารถเปลี่ยนโรงพยาบาลได้ เป็นต้น\n"
        "7.  สิทธิที่จะได้รับการปกปิดข้อมูลเกี่ยวกับตนเอง ซึ่งสิทธิในข้อนี้นั้นเป็นจรรยาบรรณที่บัญญัติไว้ในข้อบังคับของวิชาชีพทางด้านสุขภาพที่ผู้ประกอบวิชาชีพต้องปฏิบัติตามอย่างเคร่งครัด เว้นแต่จะได้รับความยินยอมจากผู้ป่วยหรือเป็นการปฏิบัติหน้าที่ตามกฎหมาย\n"
        "8.  สิทธิที่จะได้รับทราบข้อมูลอย่างครบถ้วนในการตัดสินใจเข้าร่วมหรือถอนตัวจากการเป็นผู้ถูกทดลอง หมายความว่าในบางกรณีหมอจะทำการศึกษาวิจัย ตัวยา หรือเทคโนโลยีในการรักษาใหม่ๆต้องทำในผู้ป่วย เราในฐานะผู้ป่วยก็มีสิทธิที่จะทราบถึงรายละเอียดของการทดลอง ผลดี ผลเสีย ,ระยะเวลาการทดลองหรือข้อมูลต่างๆเพื่อประกอบการตัดสินใจว่าจะเข้าร่วมในการทดลองครั้งนี้หรือถ้าเข้าร่วมแล้วก็มีสิทธิที่จะถอนตัวจากการทดลองได้\n"
        "9.  สิทธิที่จะได้รับทราบข้อมูลเกี่ยวกับการรักษาพยาบาลเฉพาะของตนที่ปรากฏในเวชระเบียนเมื่อร้องขอ ทั้งนี้ต้องไม่เป็นการละเมิดสิทธิส่วนตัวของบุคคลอื่น หมายความว่า ผู้ป่วยมีสิทธิที่จะขอข้อมูลส่วนตัวที่เกี่ยวกับการรักษาพยาบาลของตนเองที่อยู่ในเวชระเบียน แต่ไม่ใช่ไปขอ เอกสารเวชระเบียน เพราะเอกสารเวชระเบียนเป็นทรัพย์สินของทางสถานพยาบาล"
        "10.  บิดา มารดา หรือผู้เทนโดยชอบธรรม อาจใช้สิทธิแทนผู้ป่วยที่เป็นเด็กอายุยังไม่เกินสิบแปดปีบริบูรณ์ ผู้บกพร่องทางกายหรือจิตซึ่งไม่สามารถใช้สิทธิด้วยตนเองได้ ซึ่งสิทธิข้อนี้นั้นมีบัญญัติไว้ในประมวลกฎหมายแพ่งและพาณิชย์อยู่แล้ว เพียงแต่นำมาไว้ในคำประกาศสิทธิผู้ป่วยเพื่อย้ำถึงความที่มีอยู่ของสิทธิดังกล่าว\n\n\n"
        "ที่กล่าวมาทั้งหมดนั้นเป็นคำประกาศสิทธิทั้ง 10 ประการ ซึ่งข้อที่มักจะมีปัญหาเสมอๆก็คือข้อ 3 ซึ่งเป็นเรื่องการรับทราบข้อมูลอย่างเพียงพอเกี่ยวกับโรคที่ผู้ป่วยเป็น,กระบวนการในการรักษา,ผลการรักษา,ผลข้างเคียงหรือรายละเอียดต่างๆที่ผู้ป่วยต้องทราบ ซึ่งเมื่อเกิดความไม่เข้าใจกันก็มักจะนำมาซึ่งการร้องเรียน ฟ้องร้องเป็นคดีความขึ้นโรงขึ้นศาลกัน ส่วนอีกข้อที่มักจะมีปัญหามากในทางปฏิบัติคือ สิทธิในข้อ 9 ซึ่งเกิดขึ้นผู้ป่วยต้องการขอข้อมูลเกี่ยวกับการรักษาของตนเองเพื่อนำไปรักษาต่อหรือนำไปใช้ในกรณีอื่น ผู้ป่วยมักจะต้องการสำเนาของเวชระเบียน แต่ทางสถานพยาบาลมักจะให้เป็นใบรับรองการรักษาซึ่งหมอก็จะสรุปรายละเอียดเกี่ยวกับการรักษาไว้ในใบรับรองนี้ ซึ่งผู้ป่วยไม่ค่อยพอใจอาจจะสงสัยและคิดว่าทางหมอปกปิดข้อมูลที่บันทึกไว้ในเวชระเบียน ทั้งๆที่ใบรับรองดังกล่าวก็มีรายละเอียดครบถ้วนแล้ว การที่หมอไม่ได้สำเนาเวชระเบียนให้กับผู้ป่วยอาจเป็นเพราะ ในเวชระเบียนหมอมักจะบันทึกไว้ด้วยลายมือที่ไม่ค่อยเรียบร้อยหรือที่เราเรียกกันว่าเขียนหวัดๆ อ่านไม่ค่อยออก ต้องเป็นเจ้าของลายมือเท่านั้นถึงจะอ่านออกทำให้เมื่อผู้ป่วยได้สำเนาไปเพื่อรักษาต่อแล้ว หมอที่รักษาต่ออ่านไม่รู้เรื่อง ดังนั้น เมื่อผู้ป่วsยได้ใบรับรองการรักษาก็น่าจะเป็นข้อมูลที่เพียงพอสำหรับนำไปเป็นข้อมูลในการรักษาต่อแล้ว แต่ถ้าผู้ป่วยยังยืนยันที่จะขอสำเนาเวชระเบียน ก็เป็นสิทธิที่จะทำได้และทางสถานพยาบาลก็ต้องทำให้ เพียงแต่ว่าจะทำให้ทางสถานพยาบาลรู้สึกว่า อาจจะถูกผู้ป่วยร้องเรียนหรือฟ้องร้องได้ ทำให้ความสัมพันธ์ระหว่างผู้ป่วยกับผู้ประกอบวิชาชีพสุขภาพแย่ลงส่วนฟิล์มเอกซ์เรย์ หรือแบบพิมพ์ฟันนั้น เมื่อผู้ป่วยขอ ถ้าเป็นสถานพยาบาลของรัฐมักจะไม่มีปัญหา ซึ่งทางสถานพยาบาลจะให้ผู้ป่วยไปโดยให้ผู้ป่วยลงลายมือชื่อไว้ว่าเป็นคนรับไปเก็บรักษาเอง แต่สำหรับสถานพยาบาลเอกชนแล้ว เนื่องจากทั้งฟิล์มเอกซ์เรย์และแบบพิมพ์ฟัน เป็นหลักฐานอื่นที่เกี่ยวกับการรักษาพยาบาลตาม พ.ร.บ.สถานพยาบาล พ.ศ. 2541 ซึ่งทางสถานพยาบาลจะต้องเก็บรักษาไว้ ไม่น้อยกว่า 5 ปี ตามกฎหมาย แต่ถ้าผู้ป่วยต้องการจริงๆก็สามารถดำเนินการได้โดยทำเป็นหนังสือขอเป็นทางการกับทางสถานพยาบาลนั้นและลงลายมือชื่อไว้เช่นเดียวกับกรณีของสถานพยาบาลของรัฐเป็นรายๆไปซึ่งท้ายที่สุดแล้วก็เป็นไปเพื่อประโยชน์สูงสุดของผู้ป่วยนั่นเอง",
  ),
];

class Volunteere {
  String name;

  String lebbel;

  Volunteere({
    required this.name,
    required this.lebbel,
  });
}

List<Volunteere> volunteere = [
  Volunteere(
    name: "1. สิทธิ์เบิกได้",
    lebbel:
        "สามารถเบิกค่าใช้จ่ายจากทางราชการได้ตามอัตราไม่เกินกว่าที่กรมบัญชีกลาง กระทรวงการคลังกำหนดไว้ ดังนี้ \n- การอุดฟัน\n - การถอนฟัน\n - การผ่าฟันคุด,\nการผ่าตัดอื่นๆ เกี่ยว"
        "กับช่องปากและขากรรไกร\n- การรักษาโรคปริทันต์\n- การรักษารากฟัน\n- การแก้ไขการสบฟันที่ผิดปกติ\n- การเคลือบฟลูโอไรด์ทั้งปาก\n- การใส่เฝือกฟัน\n- การฟอกสีฟันที่ตายแล้ว"
        "\n- การใส่เครื่องมือปิดช่องเพดานโหว่\n( สอบถามราคาได้ที่หน่วยบริการทันตกรรมของรัฐทุกแห่ง) โดยนำใบเสร็จจากสถานพยาบาลของรัฐ ไปเบิกจากหน่วยงานต้นสังกัด"
        "ของท่าน หรือ ท่านทำบัตรระบบจ่ายตรง ( on line) ณ สถานพยาบาลของรัฐที่ท่านทำการรักษาอยู่ ภายใน 1 ปีนับจากวันที่ระบุในใบเสร็จ แต่ท่านไม่สามารถเบิกจ่ายได้ในกรณี"
        "เคลือบหลุมร่องฟัน, ฟอกสีฟันมีชีวิต, ใส่เครื่องมือจัดฟันทุกกรณี ตั้งแต่ 1 สิงหาคม 2551 เป็นต้นไป ข้าราชการสามารถเบิกค่าใช้จ่ายการใส่ฟันเทียมพลาสติกถอดได้ และครอบ"
        "ฟัน (ดูกำหนดราคาได้ที่สถานพยาบาลของรัฐ) แต่ไม่สามารถเบิกจ่ายตรง ต้องสำรองจ่ายเงินแล้วนำใบเสร็จไปเบิกคืนภายหลัง",
  ),
  Volunteere(
    name: "2. สิทธิ์ประกันสังคม",
    lebbel:
        "สามารถเบิกค่าใช้จ่ายจากสำนักงานประกันสังคม ได้ครั้งละ 250 บาท จำนวน 2 ครั้งต่อปี ตามรายการดังนี้ - การอุดฟัน - การขูดหินปูน - การถอนฟัน และการใส่ฟันเทียมถอด"
        "ได้ฐานพลาสติก (ฟันเทียมไม่เกิน 5 ซี่ เบิกได้ 1200 บาท , มากกว่า 5 ซี่เบิกได้ 1400 บาท) โดยนำใบเสร็จจากสถานพยาบาลของรัฐหรือเอกชนก็ได้ แนบกับใบรับรองการ"
        "รักษาจากทันตแพทย์ (ที่มีเลขใบประกอบโรคศิลปะ) ไปเบิกคืนกับสำนักงานประกันสังคมภายใน 1 ปีนับจากวันที่ระบุในใบเสร็จ",
  ),
  Volunteere(
    name: "3. สิทธิ์บัตรทอง",
    lebbel:
        "สามารถไปรักษาทางทันตกรรมได้โดยไม่เสียค่าใช้จ่ายใดๆ ณ โรงพยาบาลของรัฐที่ระบุในบัตรทอง ดังต่อไปนี้\n- การอุดฟัน\n- การรักษาโรคปริทันต์\n- การถอนฟัน\n- การผ่าฟันเทียมพลาสติกแบบถอดได้"
        "\nระยะเวลา 5 ปี / ชิ้น ( สอบถามสิทธิ์บัตรทองได้ที่สถานบริการของกระทรวงสาธารณสุขทุกแห่ง) โดย คณะทำงานการสื่อสารกับประชาชน\n- คณะ"
        "อนุกรรมการคุ้มครองผู้บริโภค\n- ทันตแพทยสภา13.1.1 ฟันและรากฟัน",
  ),
];

class Historye {
  String name;

  String lebbel;

  Historye({
    required this.name,
    required this.lebbel,
  });
}

List<Historye> historye = [
  Historye(
    name: "วันก่อตั้งของทันตแพทยสภา",
    lebbel:
        "ทันตแพทยสภามีฐานะเป็นนิติบุคคลและก่อตั้งขึ้นเมื่อ วันที่ 6 กันยายน พ.ศ.2537 ตามกฎหมายที่เรียกว่า “พระราชบัญญัติวิชาชีพทันตกรรม พ.ศ.2537”\n\n",
  ),
  Historye(
    name: "ทันตแพทยสภามีวัตถุประสงค์",
    lebbel:
        "1. ส่งเสริมการศึกษา การวิจัย และการประกอบวิชาชีพในทางการทันตแพทย์\n"
        "2. ส่งเสริมความสามัคคี และผดุงเกียรติของสมาชิก\n"
        "3. ผดุงไว้ซึ่งสิทธิ ความเป็นธรรม และส่งเสริมสวัสดิการให้แก่สมาชิก\n"
        "4. ควบคุมความประพฤติของผู้ประกอบวิชาชีพทันตกรรมให้ถูกต้องตามจรรยาบรรณแห่งวิชาชีพทันตกรรม\n"
        "5. ช่วยเหลือ แนะนำ เผยแพร่และให้การศึกษาแก่ประชาชนและองค์กรอื่นในเรื่องที่เกี่ยวกับการทันตแพทย์และการทันตสาธารณสุข"
        "6. ให้คำปรึกษาหรือข้อเสนอแนะต่อรัฐบาลเกี่ยวกับการทันตแพทย์และการทันตสาธารณสุข"
        "7. เป็นตัวแทนของผู้ประกอบวิชาชีพทันตกรรมในประเทศไทย\n",
  ),
  Historye(
    name: "บทบาทและหน้าที่ของทันตแพทยสภา",
    lebbel:
        "1. รับขึ้นทะเบียนและออกใบอนุญาตให้แก่ผู้ขอเป็นผู้ประกอบวิชาชีพทันตกรรม\n"
        "2. วินิจฉัยชี้ขาดอย่างใดอย่างหนึ่งดังต่อไปนี้ ในการที่ผู้ประกอบวิชาชีพทันตกรรมถูกกล่าวหา หรือถูกกล่าวโทษว่าประพฤติผิดจรรยาบรรณแห่งวิชาชีพทันตกรรม คือ\n"
        "\t\t2.1 ยกข้อกล่าวหาหรือข้อกล่าวโทษ\n"
        "\t\t2.3 ภาคทัณฑ์\n"
        "\t\t2.4 พักใช้ใบอนุญาตมีกำหนดเวลาตามที่เห็นสมควรแต่ไม่เกิน 2 ป\n"
        "\t\t2.5 เพิกถอนใบอนุญาต\n"
        "3. รับรองปริญญา ประกาศนียบัตรในวิชาทันตแพทยศาสตร์ หรือวุฒิบัตรในวิชาชีพทันตกรรมของสถาบันต่าง ๆ เพื่อประโยชน์ในการสมัครเป็นสมาชิกทันตแพทยสภา\n"
        "4. รับรองหลักสูตรต่าง ๆ สำหรับการฝึกอบรมเป็นผู้ชำนาญการในสาขาต่าง ๆ ของวิชาชีพทันตกรรมของสถาบันที่ทำการฝึกอบรมเป็นผู้ชำนาญการในสาขาต่าง ๆ ของวิชาชีพทันตกรรม\n"
        "5. รับรองวิทยฐานะของสถาบันที่ทำการฝึกอบรมใน (4)\n"
        "6. ออกหนังสืออนุมัติหรือวุฒิบัตรแสดงความรู้ความชำนาญในการประกอบวิชาชีพทันตกรรมสาขาต่าง ๆ และออกหนังสือแสดงวุฒิอื่นในวิชาชีพทันตกรรม\n"
        "7. ดำเนินการให้เป็นไปตามวัตถุประสงค์ของทันตแพทยสภา\n",
  ),
  Historye(
    name: "ความหมายของวิชาชีพทันตกรรม",
    lebbel: "1. วิชาชีพที่กระทำต่อมนุษย์\n"
        "2. เกี่ยวกับการตรวจ การวินิจฉัย การบำบัด หรือการป้องกัน\n"
        "\t\t2.1 โรคฟัน\n"
        "\t\t2.2 โรคอวัยวะที่เกี่ยวกับฟัน\n"
        "\t\t2.3 โรคอวัยวะในช่องปาก\n"
        "\t\t2.4 โรคขากรรไกรและกระดูกใบหน้าที่เกี่ยวเนื่องกับขากรรไกร\n"
        "3. การกระทำทางศัลยกรรม และการกระทำใดๆ ในการบำบัด บูรณะและฟื้นฟูสภาพของอวัยวะในช่องปาก กระดูกใบหน้าที่เกี่ยวเนื่องกับขากรรไกร\n"
        "4. การทำฟันในช่องปาก\n",
  ),
  Historye(
    name: "องค์ประกอบของทันตแพทยสภา",
    lebbel:
        "คณะกรรมการทันตแพทยสภา ประกอบด้วยจำนวนคณะกรรมการซึ่งมีแหล่งที่มาของกรรมการ 3 แหล่ง รวม 32 คน โดยมีรายละเอียดดังต่อไปนี้\n\n"
        "*เริ่มใช้มาตั้งแต่ตั้งแต่ วาระ 6 (พ.ศ.2553-2556)*\n\n"
        "1. กรรมการโดยตรง รวม 11 คน\n"
        "\t\t1.1 ปลัดกระทรวงสาธารณสุข 1 คน\n"
        "\t\t1.2 นายกทันตแพทยสมาคมแห่งประเทศไทยฯ 1 คน\n"
        "\t\t1.3 คณบดีคณะทันตแพทยศาสตร์ 9 คน\n"
        "2. กรรมการโดยการแต่งตั้งจาก 3 กระทรวง รวม5 คน\n"
        "\t\t2.1 กระทรวงสาธารณสุข 3 คน\n"
        "\t\t2.2 กระทรวงกลาโหม 1 คน\n"
        "\t\t2.3 กระทรวงมหาดไทย 1 คน\n"
        "3. กรรมการจากการเลือกตั้งโดยสมาชิกทันตแพทยสภา รวม 16 คน\n",
  ),
];
